/**
 *   Логика действий в некоторых ситуациях
 * 
 * 
 */

function logic (engine){
	/**
	 * задача - послать войска по адресу и с целью
	 * engine.goal('sendTroops',{
	 * 	troops:[20,0,0,0,3,2], // - список войск
	 *  destination:engine.village(-40,386) // - точка карты - назначения
	 *  src: // - деревня, откуда 
	 *  time: время прибытия
	 * })
	 */
	engine.handle('goal:sendTroops',function(param){
		// разрешаем точку отправления - param.src_vilage
		// перебираем все деревни с наличными войсками
		// из всех деревень выбираем ближайшую
		// - нету - выставляем себя в событие "on troops back" 

		// точка отправления определена
		// -- открываем новое окно отправки войск
		// вставляем нужное количество войск
		// нажимаем послать
		// в следующем окне нажимаем "послать"
		// если определено точное время прибытия, 
		// открываем окно отправки в новом окне, расчитываем время и ждем.
		
	});

	/**
	 * задача - фармить деревню
	 * -- повторяемая задача.
	 * engine.goal('farmvillage',{
	 *  destination:engine.village(-40,386) // - точка карты - назначения
	 *  // -- при анализе результатов проверяем еще и предполагаемую продуктивность.
	 *  
	 *  // фарм конкурентный - назначаем минимальное необходимое количество солдат 
	 *  //     для полного выноса добра. Назначаем фарм при наполнении на 2 солдата.
	 *  // фарм первый раз - назначаем максимум свободных сил
	 *  // повторяем фарм до полного выноса рессурсов.
	 *  // фарм агрессивный. Ходим редко, максимальными силами... (идиотизм)
	 *  //
	 *  src: // - деревня, откуда 
	 *  time: время прибытия
	 * })
	 */
	engine.handle('goal:sendTroops',function(param){
		// разрешаем точку отправления - param.src_vilage
		// перебираем все деревни с наличными войсками
		// из всех деревень выбираем ближайшую
		// - нету - выставляем себя в событие "on troops back" 

		// точка отправления определена
		// -- открываем новое окно отправки войск
		// вставляем нужное количество войск
		// нажимаем послать
		// в следующем окне нажимаем "послать"
		// если определено точное время прибытия, 
		// открываем окно отправки в новом окне, расчитываем время и ждем.
		
	});

}

